{
  "summary": "Technology executive with 17+ years of experience leading AI innovation, software delivery, and global consulting in the energy sector. Currently Vice President at Bluware (a CMG company), Adnan Latif is responsible for internal AI development and for leading the Global Platform & Consulting Services business.\nHe is known for delivering real-world impact by bridging technical, commercial, and R&D teams. His background in Physics, combined with advanced expertise in AI and software engineering and an MBA in Finance, provides a solid foundation for cross-disciplinary leadership.\nAdnan builds AI systems that domain experts actually use — tools that simplify work, reduce uncertainty, and accelerate decision-making. At Bluware, he leads AI strategy and oversees global consulting services, delivering advanced AI capabilities and cloud-native software for clients worldwide. His teams focus on building scalable, high-performance systems that make it easier to interpret complex data and take action quickly.\nFrom 2017 to 2023, Adnan co-led the SIRIUS SFI — a national AI research and innovation program backed by the Norwegian Research Council, leading universities, and major energy companies. The program’s mission was to bridge the gap between academic research and industrial use, bringing cutting-edge ideas into practical tools and platforms.\nEarlier in his career, Adnan spent over a decade working hands-on with subsurface data and interpretation workflows. That practical experience continues to shape his product and team leadership today — ensuring that every AI system is built with purpose, grounded in user needs, and aligned with real-world challenges.\nOutside work, Adnan enjoys skiing, fishing, and going fully offline — preferably somewhere remote, without Wi-Fi, and with plenty of space to think.",
  "core_competencies": "AI Strategy, Development & Implementation, Subsurface AI & G&G Workflows, Software Development, Cloud-Native Platforms, R&D to Product Delivery, Cross-Company Solution Design, Commercial Growth & Business development, Organizational Scale-Up, Executive Stakeholder Alignment, Team Building & Talent Development, Cross-functional Collaboration",
  "business_impact": "Adnan Latif serves as the go-to leader for Data, AI, and Geoscience across the CMG Group, driving enterprise strategy, business development, and integrated subsurface solutions. At Bluware, he formally leads AI development while overseeing the Global Platform & Consulting Services business. Under his leadership, Bluware delivered advanced AI features across its core product lines and built a robust consulting business that achieved 25% year-over-year revenue growth. He led the global services team to maintain over 80% utilization and secured multiple multi-million-dollar contracts. Adnan spearheaded business development for the unit—launching new service lines, entering new markets, and shifting 40% of revenue to non-core clients. He also standardized project delivery and operations, improving speed, scale, and execution quality across the organization. Known for building a high-performance culture, he has developed future leaders and tightly aligned delivery efforts with strategic business outcomes.",
  "experience": "VP of AI & Consulting:\nBluware, CMG\nApril 2024 - Present\nOslo, Norway\nPart of the Bluware Executive team reporting to the CEO, I manage the AI and Global Platform & Consulting Services business unit, leading a team of 70+ supper humans.\nAdnan Latif serves as the go-to leader for Data, AI, and Geoscience across the CMG Group, driving strategy, business development, and the delivery of integrated subsurface solutions. At Bluware, he formally leads AI development and oversees the Global Platform & Consulting Services business.\nHe has led the AI strategy and execution across Bluware’s product portfolio, embedding advanced machine learning capabilities into core offerings. In parallel, he heads the Platform & Consulting Services unit, delivering custom AI and cloud-native software solutions to a global client base. Under his leadership, the Services business has achieved 25% year-over-year revenue growth, closed multiple multi-million-dollar contracts, and maintained over 80% utilization across its consulting team.\nAdnan also spearheads business development efforts, launching new service lines, entering new markets, and diversifying the customer base—resulting in 40% of revenue now originating from non-core clients. He has standardized delivery operations, improved execution at scale, and built a high-performance culture rooted in ownership, speed, and client impact.\nHis dual leadership role—driving both internal AI innovation and global consulting delivery—positions Bluware to advance its proprietary technology stack while solving complex, high-value challenges for clients across energy and beyond.\nSkills: Machine Learning Computer Vision, Deep Learning, Research and Development, Machine Learning, Software development, People Leadership, People Management, Project Management, Stakeholder Management, Business development.  Consulting\n\n       \nDirector of AI\nBluware, CMG\nSep 2023 - April 2024\nOslo, Norway \nAdnan Latif is the go-to person for all things AI at Bluware. He leads high-performing teams focused on developing advanced AI-based software solutions, turning bold ideas into impactful products that push the boundaries of what's possible.\nWith a strong focus on combining deep technical expertise with practical domain insight, Adnan ensures that Bluware’s AI solutions deliver real-world value. He keeps teams aligned, agile, and outcome-driven—building systems that not only perform, but make a measurable difference for clients operating in complex environments.. \nSkills: Machine Learning Computer Vision, Deep Learning, Research and Development, Machine Learning, Software development, People Leadership, People Management, Project Management, Stakeholder Management, Business development.  Consulting\n\nCentre Executive Manager,Coordinator\nSIRIUS Center for Research-driven Innovation \nNov 2021 – Aug 2023\nOslo Area, Norway\nAdnan has co-led one of Norway’s largest industrial research consortia (400 MNOK), focused on scalable data access and AI innovation across energy, environment, and healthcare.\nOversaw strategy and executive operations across a multidisciplinary network of universities, energy operators, and technology providers — aligning academic innovation with real-world impact.\n\nPortfolio Manager (AI, Innovation)\nSIRIUS Center for Research-driven Innovation \nAug 2017 – Aug 2023\nOslo Area, Norway\nAdnan Latif led the largest innovation portfolio within SIRIUS – the Centre for Scalable Data Access – focusing on the intersection of cutting-edge AI technologies and their application across the energy, environmental, and medical sectors. His work spanned machine learning, deep learning, natural language processing, ontology engineering, formal methods, and semantic technologies.\nIn this role, he:\nDefined what to build and why, aligning research objectives with real-world impact.\nWorked closely with over 20 industry partners to identify high-value business challenges and translate them into solvable AI problems—while also driving adoption of SIRIUS-developed technologies through strategic technology push.\nLed a team of project managers across multiple innovation initiatives, ensuring strategic focus, execution discipline, and delivery from concept to deployment.\nOversaw solution rollouts, captured user feedback, and guided iterative improvements to ensure meaningful adoption and sustained value.\nThis portfolio positioned SIRIUS at the forefront of applied AI innovation, bridging academic research with industrial transformation.\nSIRIUS was a leading research-driven consortium that brought together top industry and academic partners to drive digital innovation across complex domains. The consortium included global energy operators like Equinor, along with service companies such as Schlumberger, Aibel, Aker Solutions, Robert Bosch GmbH, DNV GL, and TechnipFMC. It also partnered with prominent technology firms — including Computas, Dolphin Interconnect Solutions, Evry, IBM, Kadme, Numascale, OSISoft, SAP, Billington Process Technology, ONTOPIC, Oxford Semantic Technologies, Prediktor, and Bouvet. These industry leaders collaborated closely with academic institutions such as the University of Oslo, NTNU, the University of Oxford, and Simula Research Laboratory to accelerate the real-world impact of AI, semantic technologies, and scalable software systems.\nSkills: Deep Learning, Ontology, Research and Development, Machine learning, semantic technology, Formal methods, NLP, Ontology based data access, Domain adapted data science, Symbolic and Sub-symbolic integration. Physics informed AI, Software Development.  Project, Program & Portfolio Management, Consulting\n\nSenior Geoscientist,Project Manager\nEMGS ASA\nAug 2012- Aug 2027\nOslo Area, Norway\nAdnan successfully delivered over 20 CSEM imaging, integration, and interpretation projects, providing high-impact consultancy to exploration companies by integrating resistivity data with seismic, geological, and petrophysical inputs for improved subsurface evaluation.     \nAs Project Manager, he led multiple client consultancy engagements, particularly during Norway's licensing rounds. He managed end-to-end project delivery — from initiation and planning to execution and closure — ensuring technical excellence and client satisfaction.\nIn business development, Adnan supported the sales team by translating technical capabilities into client value. Several of these efforts led to the initiation of major commercial projects.\n\nGeophysicist\nEMGS ASA\nAug 2012 - Jan 2014\nAdnan’s career in Controlled-Source Electromagnetics (CSEM) began hands-on, evolving through deep technical specialization and leadership roles. His core focus was on CSEM inversion, post-inversion modeling, and integrated interpretation with seismic and other geoscientific datasets.\nOver time, he expanded into frontline operations, technology demonstrations, and managing projects, products, and multidisciplinary teams. Throughout this journey, Adnan was mentored by exceptional managers and technical leaders, shaping both his expertise and leadership style.\nSkills: 2D/3D Seismic, Petrophysical, Geological Data Interpretation & Prospect Generation, Geophysical data inversion, Geological Modeling, Seismic Interpretation, Petrophysics, Project, Program & Portfolio Management, Consulting\n\nExploration Geophysicist\nPetroleum Exploration private limited (PEL)\nOct 2007 - Jul 2010\nIslamabad Pakistan\nAdnan worked as a core member of the exploration team, contributing to the evaluation of prospects across highly diverse tectonic and paleogeographic settings. He participated in nearly the entire subsurface evaluation chain — from seismic data acquisition to interpretation and final prospect generation.\nHis primary responsibilities included seismic interpretation, geological and petrophysical analysis, and delivering integrated prospect evaluations with associated risk and economic assessments.",
  "education": "Singel Subject courses (Master/PhD)\nUniversity of Oslo, 2017 - 2020\nSemantic Technologies\nMachine Learning for Image Analysis\nDatabases and Data Modelling\nOntology Engineering\nSemantic Technology\nEnergy Informatics\n\nDeep Learning Specialization\nDeeplearning.AI, 2019 - 2019\nA 5 courses specialization for Deep Learning \nCourses in this specialization \nNeural Networks and Deep Learning\nImproving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization\nStructuring Machine Learning Projects\nConvolutional Neural Networks\nSequence Models\n\nProfessional Certificate Program Digital Transformation\nKTH Royal Institute of Technology, on edX, 2018 - 2019\nThis program is focused on to understand what digital transformation is and how it may affect the organization and how to plan for rising opportunities. The program prepares professionals and managers for digital transformation challenges and helps them develop the skills to be a digital transformation agent.\nCourses in the Professional Certificate Program\nDigital Transformation: Market and Industry Analysis\nDigital Transformation: Strategy\nDigital Transformation: Leadership\nDigital Transformation: Business Development and Marketing\n\nExecutive Specialization, Data Science\nJohns Hopkins University ,on Coursera 2017 - 2018\nA 5 courses specialization focused on tools and methods to recruit, assemble, evaluate, and develop a data science team. Learn the structure of the data science pipeline, goals of each stage, and how to keep the data science team on target throughout. Finally, to learn some down-to-earth practical skills that will help you overcome the common challenges that frequently derail data science projects.\nCourses in this specialization\nA Crash Course in Data Science\nBuilding a Data Science Team\nManaging Data Analysis\nData Science in Real Life\nExecutive Data Science Capstone Projec\n\nMaster of Science - MS, Geophysics\nUniversity of Oslo, 2011 - 2012\nFor my Master thesis, I tried to decode the mystery of the origin of Scandanivan mountains by using the tomographic Inversion of Pn waves. It was a study to reveal the upper mantle velocity structure to explain anomalous topography of the Scandinavian Mountains.\nThesis Title: Tomographic inversion of Pn waves beneath southern Scandinavia.\n\nMaster of Science - MS, Physics\nUppsala University, 2010 - 2011\nMaster’s degree in physics, completed 90 Cr hours at Uppsala University in one year and then continued to UiO for further studies.\n\nMaster of Business Administration - MBA, Finance\nVirtual University of Pakistan, 2008 - 2011\nA part-time master’s degree in business administration with a specialization in Marketing and Finance. My Master thesis was focused on the analysis of the financial health of two of the leading Oil and gas companies of Pakistan to make Investment decisions. \nThesis Title: Financial statements analysis of Oil & gas development corporation limited, and Pakistan petroleum limited.\n\nMSc, Geophysics\nQuaid-i-Azam University, Islamabad, 2005 - 2007\nMaster’s degree in Geophysics. In my master thesis, I worked on workflow development/testing of an integrated approach for planning and designing of the land 3D seismic survey.\nThesis Title: 3D Seismic data acquisition planning & designing using integrated software.\n\nBSc, Physics, Chemistry & Mathematics\nUniversity of the Punjab, 2003 - 2005\nBachelor’s degree with major in Science (Physics, Mathematics and Chemistry)\n\nAssociate Engineering, Electronics\nSwedish Institute of Technology, 1997 - 2000\nThree years Associate Engineering degree, with specialization in Electronics",
  "licenses_certifications": "Customer Success Manager: Fundamentals Udemy\nMicrosoft Certified- Azure Fundamentals, Microsoft\nProject Management Professional (PMP), Project Management Institute",
  "recommendations": "Keith Lewis\nSenior Advisor\nOctober 2, 2022, Keith worked with Adnan on the same at SIRIUS\n“Adnan has a strong delivery and improvement mindset. He has a great personality who naturally develops and help others.”\n\nKnut Sebastian Tungland\nSenior Advisor at Equinor\nSeptember 25, 2020, Knut Sebastian was senior to Adnan but didn't manage Adnan directly at SIRIUS\n“Adnan is persistent and thorough. I have had the privilege to work with Adnan through Sirius research center. He has a broad understanding of subsurface and the challenges in the domain, in particular related to data management and data utilization. As a manager he keeps the focus at the target, ensures transparency and progress.” \n\nFrode MyrenFrode Myren\nRetired IBM Distinguished Engineer (Frilans)\nOctober 9, 2018, Frode worked with Adnan on the same team at SIRIUS\n“I have been fortunate in having worked with Adnan through our collaboration in the Sirius project for a couple of years, and especially the last year. Adnan has a very wide range of experiences. He understands AI concepts such as Machine Learning and NLP, and also Geoscience, which is very useful combination for establishing understanding and leading our collaboration and project. Adnan is then also very structured and is doing an excellent job in managing projects, including \"ours\". He is able to identify key risks and is able to formulate, explain and present this to the executive board. I am glad to be able to give my recommendations to Adnan”\n\nCharles Thomas\nFounder of Striped-Horse l Director of Business Development Quantum Xploration November 18, 2016, Charles was senior to Adnan but didn't manage Adnan directly at EMGS\n“I worked with Adnan on a number of critical projects in Africa in 2014 and 2015. He is punctual, professional and detail oriented. He works well in multi-functional teams and I look forward to seeing him grow and develop in the future.”\n\nMartin Hansen\nDirector of Sales Norway and Europe - Electromagnetic Geoservices ASA\nOctober 20, 2016, Martin was senior to Adnan but didn't manage Adnan directly at EMGS\n“I have had the pleasure of working with Adnan in EMGS since 2012. In this period he has supported the sales team in several occasions. With his strong technical background and his excellent knowledge of CSEM, he has helped our customers increasing their knowledge and supported them in the integration and interpretation of the CSEM data. \nAdnan works hard, is dedicated and a great team player. I am very happy to recommend Adnan. “\n\nRaymond Svendsen\nProsjektleder, Sykehuspartner HF\nOctober 18, 2016, Raymond managed Adnan directly at EMGS\n“Adnan has demonstrated to be a highly skilled geophysicist and his talent was quickly recognized and promotion to Senior came early. He always show great passion for his work and we find him to be dedicated and structured in the work approach, leading systematically to good results and building confidence with our clients. Continuously Adnan proves his ability to function independently as well as in co-operation across disciplines.”\n\nBjørn Petter LindhomBjørn Petter Lindhom\nChief Executive Officer at Electromagnetic Geoservices ASA\nOctober 14, 2016, Bjørn Petter was senior to Adnan but didn't manage Adnan directly at EMGS\n“In my position as President of EMGS EMEA Region, I had the pleasure of working with Adnan. He has a strong technical background in geoscience. He has gained a deep understanding of CSEM including processing, inversion and modeling. He is very committed, works hard and can always be trusted to deliver on time. I am pleased to recommend Adnan.”\n\nLina L. Uri\nTeacher at Hersleb VGSTeacher at Hersleb VGSOctober 14, 2016, Lina L. was senior to Adnan but didn't manage Adnan directly at EMGS\n“Adnan is dedicated and focused on his work; he takes initiatives, works independently, and plans the projects he is responsible for well. He is also a team player who shares his insight and experiences, which makes him easy to collaborate with. It has been a pleasure to work with him!”\n\n\nValerie Maupin\nProfessor at University of OsloFebruary 19, 2016, Valerie was Adnan’s teacher at UiO\n“Adnan worked with me for his master project. He did a great job trying to invert a very difficult data set for the deep structure of the North Sea. He has a very good background and will be able to adapt easily to new problems. In addition he is very nice to work with, seeing possibilities more than problems.”\n\nzia ur rehman khan\nCEO at PETROTRAP OIL & GAS (a training and consultancy company) February 13, 2016, zia ur rehman was senior to Adnan but didn't manage Adnan directly at PEL\n“Adnan is very intelligent, hardworking, result oriented professional. In his job he is details oriented and have a significant contribution to company.” \n\n\nJohn Ege\nManager, May 6, 2013, John managed Adnan directly at EMGS\n“Signing on to EMGS as manager January 2013, it is a great pleasure to get to know Adnan Latif. \nHe is simply a splendid colleague, both technical and social, and takes upon him any challenge, geological, geophysical or petrophysical.”\n\nM. Naeem QAZIM. Naeem QAZI\nPetroleum Exploration AdvisorOctober 24, 2011, M. Naeem managed Adnan directly at PEL“To Whom it May Concern \nThis is to state and verify that Mr. Adnan Latif worked as a Geophysicist under me in Petroleum Exploration (pvt) Ltd, Islamabad, Pakistan for more than one year before he left for higher studies in Europe. \nDuring the period that he worked under me I found him an extra ordinary individual: intelligent, hard working and totally committed to his work. \nThough a Geophysicist by training, he took keen interest in related disciplines like Geology and Petrophysics and in a short period of time developed enough expertise as a budding Explorationist. \nI see in him great potential as a valuable petroleum explorationist and can safely recommend him to any oil company for a suitable position. \nM. Naeem Qazi \nEx. General Manager Exploration, Petroleum Exploration (pvt)Ltd and Oil and Gas Development”\n\nSajid AbidSajid Abid\nFounder@ Current Company | Mineral Exploration, Petroleum Geology\nSeptember 21, 2011, Sajid managed Adnan directly at PEL\n“Adnan is a goal oriented professional with initiative and drive. He is willing and able to take on additional responsibility. In addition he is a team player and willing to do his best for the team.”\n\nBob MummeryBob Mummery\nsemi-retiredsemi-retiredJuly 25, 2011, Bob worked with Adnan but they were at different companies at PEL\n“Adnan was very receptive to learning seismic methods for the interpretation of depositional facies in carbonates. He was adept at the integration of geological information with seismic character responses. He is a diligent and skillful interpreter with many years of experience in the Indus basin onshore Pakistan.”",
  "publications": "1. Augmented Reservoir Characterization with Stochastic Rock Property Estimation\nChallenge: Traditional reservoir characterization struggles with uncertainty and sparse well data.\nSolution: Developed an augmented system leveraging stochastic inversion and machine learning to estimate rock properties with improved confidence and explainability.\nReference: Ramsay, T.S.G., Sabzi, R., Al Naqbi, S., Bawolek, A., Salahuddin, A.B., Holtar, E., Fouladi, H., Latif, A. (2025). Augmented Reservoir Characterization Technology for the Stochastic Estimation of Rock Properties. SPE-2025.\n\n2. Interactive ML-Assisted Seismic Interpretation using Meta-Labeling\nChallenge: Seismic interpretation is labor-intensive and subjective, often requiring manual iterations.\nSolution: Introduced an interactive interpretation workflow combining user-driven feedback with meta-labeling for rapid retraining of ML models.\nReference: Fouladi, S.H., Sabzi, R., Holtar, E., Latif, A. (2024). Interactive ML-Assisted Seismic Interpretation Using Advanced Meta-Labelling. EAGE 2024.\n\n3. Scalable End-User Access to Subsurface Data with Ontologies\nChallenge: Domain experts struggle to query large subsurface datasets due to technical barriers like SQL.\nSolution: Showcased ontology-based interfaces that allow scalable, user-friendly access to structured subsurface data through semantic queries.\nReference: Latif, A., Kontchakov, R., Skjæveland, M.G. (2022). Scalable end-user access to the subsurface data with ontologies. SPDM Online Conference, Nov 2022.\n\n4. OBDA: Subsurface Databases on Steroids\nChallenge: Legacy databases lack semantic interoperability and agility.\nSolution: Applied OBDA to accelerate query performance and data integration across siloed subsurface datasets.\nReference: Latif, A., Kontchakov, R. (2022). Ontology-based data access – subsurface databases on steroids. ECIM Annual International E&P DM Conference, Haugesund.\n\n5. Multi-Scenario Geological Reasoning for Subsurface Evaluation\nChallenge: Exploration decisions are often based on a single “best guess” model.\nSolution: Introduced a logic-based reasoning framework enabling interpreters to model multiple geological scenarios systematically.\nReference: Yu, I., Pene, I., Din, C., Karlsen, L., Nguyen, C.M., Stahl, O., Latif, A. (2021). Subsurface Evaluation Through Multi-scenario Reasoning. In: Akerkar R. (eds) Artificial Intelligence and Digital Transformation in the Petroleum Industry. Springer. \n\n6. Data-Based Support for Prospect Evaluation\nChallenge: Manual geological evaluation is slow and error-prone.\nSolution: Developed data-driven support systems to guide prospect screening and evaluation using structured reasoning.\nReference: Mumtaz, S., Pene, I., Latif, A., et al. (2020). Data-based support for petroleum prospect evaluation. Earth Sci Inform 13, 1305–1324.\n\n7. Ontology-Driven Annotation System for Geological Images\nChallenge: Geological images are hard to search, interpret, and reuse due to lack of metadata.\nSolution: Built a semantic annotation platform using ontologies to tag and retrieve geological imagery by concept.\nReference: Latif, A., Jiménez-Ruiz, E., Giese, M., Stahl, O., Pene, I., Heeremans, M., Grimsgaard, J., Abreu de Paula, R., de Santana, V.F., Myren, F. (2019). Ontology-driven annotation system for Geological Images. ECIM Conference, Haugesund.\n\n8. Ontology-Based Data Access in Exploration\nChallenge: Exploration databases lack semantic querying, limiting insight extraction.\nSolution: Demonstrated how OBDA can be applied to exploration datasets for smarter, federated data access.\nReference: Latif, A., Waaler, A., Giese, M., Hovland, D., Skjæveland, M.G. (2018). Ontology-Based Data Access in Exploration. 6th Norwegian/Brazilian Energy Research Conference, Rio de Janeiro.\n\n9. Subsurface Geomodeling from Well and Seismic Data\nChallenge: Integrating multi-modal data like seismic and well logs is difficult for 3D modeling.\nSolution: Presented advances in data integration pipelines and workflows for subsurface modeling.\nReference: Gavrilova, E., Kukina, N., Barker, N., Baltar, D., Reynisson, F., Latif, A., Shantsev, D. (2017). Abstracts and Proceedings of the Geological Society of Norway, No. 3, pp. 44–47, Oslo.\n\n10. High-Resolution Interpretation in the Barents Sea\nChallenge: Interpreting subtle hydrocarbon indicators in Arctic regions requires advanced tools.\nSolution: Developed and presented methods for fine-grained interpretation using EM and seismic data.\nReference: Latif, A., Gabrielsen, P.T., Fanavoll, S., Furuholt, V., Uri, L., Roth, F. (2013). Poster presented at: 3P Arctic Conference & Exhibition, Stavanger, Norway.\n\n11. EM-Based Prospect Evaluation Offshore Lebanon\nChallenge: Frontier basins often lack sufficient well control for traditional exploration.\nSolution: Demonstrated the use of EM techniques for early-stage reservoir identification in deep water.\nReference: Latif, A. (2013). Identifying Potential Hydrocarbon Reservoirs Offshore Lebanon with Electromagnetics. AAPG GTW, Beirut, Lebanon.\n\n12. Pn-Wave Tomography under Southern Scandinavia\nChallenge: Understanding deep crustal structure requires high-resolution imaging.\nSolution: Used tomographic inversion of Pn waves to map beneath Southern Scandinavia.\nReference: Latif, A. (2013). Tomographic Inversion of Pn Waves beneath Southern Scandinavia. 75th EAGE Conference & Exhibition, London, UK.",
  "languages": "English: Native or bilingual proficiencyNative or bilingual proficiency\nNorwegian: Full professional proficiencyFull professional proficiency\nUrdu: Native or bilingual proficiency",
  "key_areas_led_by_adnan_at_bluware": "1. As the Head of AI Development for Bluware’s Internal Product Portfolio\nAdnan is currently leading the AI development for Bluware’s internal product portfolio, with a focus on delivering production-ready, reliable, and interactive AI systems. My work spans the full AI lifecycle — from model research and experimentation to deployment within real-world software environments used by our clients.\nThis includes driving improvements in areas such as:\nReal-time inference: enabling users to interactively update model predictions within seconds, not hours\nModel robustness and reliability: ensuring consistent performance across geologies, user behavior, and data types\nHuman-in-the-loop learning: building AI systems that adapt from user input and improve over time\nHybrid architectures: combining deep learning with rule-based logic and domain signals to increase interpretability and control\nData-centric AI: improving labeling, quality assurance, and synthetic data generation to overcome noise and scarcity in real datasets\nAs part of this role, Adnan collaborate closely with engineering, product, and domain teams to ensure the AI stack is not just scientifically sound — but deeply integrated, scalable, and usable. The goal is simple: deliver AI that works where it matters — in the hands of professionals making high-impact decisions.\n\n2. As Head of Platform and Consulting services  in Bluware\nAdnan leads Bluware’s Platform and Consulting division, with a focus on delivering AI-powered platform services to clients across energy and industrial domains. His team is responsible for turning advanced AI capabilities into scalable, consumable services that clients can access without building or maintaining infrastructure.\nOn the platform side, Adnan oversees the delivery of core services that power high-performance computing, AI model execution, and large-scale data integration in the cloud. These are packaged as APIs and automated workflows, enabling integration into enterprise systems with minimal friction.\nOn the consulting side, he directs strategic engagements that apply Bluware’s AI and data capabilities to client-specific use cases — from exploration pilots to enterprise-scale deployments. This includes onboarding complex data, enabling AI workflows, and ensuring clients derive value from platform services in production environments.\n\nHis leadership ensures Bluware’s AI and cloud technologies are not just powerful, but also practical — designed to accelerate adoption and impact in real-world operations.",
  "key_projects_delivered_by_adnan_s_team_at_bluware": "Under Adnan’s leadership, Bluware’s AI and Global Services team has delivered cutting-edge solutions across multiple domains — with a focus on combining AI, software engineering, and cloud-native technologies. These initiatives were executed by the team reporting to Adnan, with some projects involving his direct technical contribution, while most were led and developed independently by his team under his strategic guidance.\nHis team has executed high-impact initiatives including:\n\nProject 1: Operationalizing Large AI Models for Seismic Interpretation (Confidential, Supper Major)\nProject Delivered by Adnan’s team\n\nPain Point\nDeep learning models developed for seismic-based hydrocarbon detection showed strong performance in R&D settings but were difficult to scale for production use. Challenges included model size, manual execution in technical environments (e.g., Jupyter), reliance on on-prem HPC, and lack of integration with interpretation workflows and data sources.\n\nAI-Driven Solution\nThe team Adnan led implemented a production-ready, end-to-end solution to deploy these large AI models in a scalable, cloud-native environment. The system enabled interpreters to interact with AI predictions in real-world workflows—without requiring programming expertise or dedicated HPC access.\nIntegrated multi-volume seismic inputs for hydrocarbon anomaly detection\nMigrated model execution from manual notebooks to a robust backend system\nEnabled seamless access via cloud and integration with interpretation tools\n\n\nProject 2: AI-Powered DHI Detection (Confidential, Supper Major)\nProject Delivered by Adnan’s team, technically lead by Adnan\n\nPain Point\nDirect Hydrocarbon Indicators (DHIs) are critical in reducing exploration risk, but manual interpretation is inconsistent and often fails to detect weak or non-standard DHI expressions—especially when working across multiple seismic stacks and uncertain geological conditions.\n\nAI-Driven Solution\nThe team Adnan led implemented a deep learning–based detection system that combined seismic stack data and well logs to identify DHI signatures with greater consistency. The solution used multi-task model architecture and transfer learning to boost generalization across diverse settings, and it incorporated both supervised and semi-supervised learning to handle sparse and noisy labels.\n Combining multiple seismic volumes with well data\n Applied a multi-task deep learning model to simultaneously predict multiple DHI indicators\n Used transfer architectures to initialize model weights from pre-trained networks\n Employed supervised learning with trusted interpreter labels and semi-supervised learning where ground truth was sparse\n Built ensemble outputs to improve confidence and reduce false positives\n\nProject 3: Predicting Geological Features Below Seismic Tuning Using Machine Learning (Major IOC)\nProject Delivered by Adnan’s team, technically lead by Adnan\n\nPain Point\nGeological features such as thin sand bodies often fall below the vertical resolution of seismic data, where tuning effects mask the true geology. Traditional interpretation techniques struggle to recover meaningful signals once seismic tuning dominates, limiting the ability to map stratigraphic features accurately in early-stage exploration.\n\nML-Driven Solution\nThe team Adnan led implemented a machine learning solution to predict geological features—particularly thin sands—below the seismic tuning threshold. By integrating seismic attributes with well log data, the model learned to infer geological presence even when seismic reflections were no longer distinct.\n Used thin sand intervals from well logs to train classification models\n Engineered features from pre-stack and post-stack seismic data to capture subtle, pre-tuning signal variations\n Incorporated geological context through amplitude, continuity, and depositional trends\n Applied probabilistic post-processing and interpreter feedback to reduce false positives\n\nProject 4: Porosity Prediction Using Physics-Informed Machine Learning (Confidential Supper Major)\nProject Delivered by Adnan’s team, technically lead by Adnan\n\nPain Point\nAccurate porosity estimation from seismic data is critical for reservoir characterization, yet conventional approaches are often limited by sparse well control and seismic resolution. Pure ML models typically ignore domain physics, resulting in black-box outputs with poor geologic consistency, limiting their operational trust and scalability.\n\nML-Driven Solution\nThe team Adnan led implemented a physics-informed machine learning solution that estimated porosity and permeability across a carbonate reservoir by integrating seismic inversion outputs, well data, and rock physics constraints. Instead of relying on deep learning, the team used a metaheuristic optimization framework grounded in empirical geophysical relationships and stochastic methods.\n Employed particle swarm optimization (PSO), including VN-PSO and HPSO-TVAC variants\n Incorporated rock physics equations linking seismic impedances to porosity and permeability\n Used regression to spatially distribute bulk modulus, shear modulus, and densities\n Applied L1-norm minimization with multiple physics-based penalty terms to preserve geological realism\n\nProject 5: Uncertainty Quantification for AI-Based Fault Predictions (Confidential IOC)\nProject Delivered by Adnan’s team, technically lead by Adnan\n\nPain Point\nAI-based fault prediction often generates probability cubes that are thresholded to produce binary outputs. However, neural networks tend to exaggerate probability extremes, which can lead to overconfident predictions. Inconsistent results across models and lack of a standard uncertainty workflow made it difficult for interpreters to assess risk reliably—especially in low signal-to-noise or geologically complex areas.\n\nAI-Driven Solution\nThe team Adnan led designed and implemented a scalable workflow to quantify prediction uncertainty in AI-based fault detection. This included:\n Generating uncertainty estimates within a single model using Monte Carlo dropout\n Comparing outputs across multiple models through ensemble techniques\n Producing confidence heatmaps that helped interpreters identify high/low certainty regions\n Embedding the workflow in a production-grade platform for interpreter-guided QC\n\nProject 6: Real-Time Fluid Prediction from Mud-Gas Logs (Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nReal-time mud-gas logs are widely collected during drilling, but converting these into actionable fluid type predictions (oil, gas, water) is still largely manual. Operators often wait hours for lab results or geochemist interpretation—missing critical moments during drilling operations.\nAI-Driven Solution\nThe team Adnan led developed and deployed a real-time machine learning system that classifies fluid types directly from streaming mud-gas data at rig speed.\n Combined time-series CNNs and GRUs to model both local signal variation and longer temporal trends\n Integrated gas ratios, lag corrections, ROP, and depth-derived features into the input stream\n Used semi-supervised learning on sparsely labeled historical datasets, enhanced by domain heuristics and probabilistic pseudo-labeling\n\nProject 7: Real-Time AI Deployment for Subsurface Interpretation (Confidential Supper Major)\nProject Delivered by Adnan’s team\n\nChallenge\nMany AI models in geoscience remain stuck in R&D due to complexity, lack of integration, and scalability barriers—especially when interpreters need real-time feedback within production environments.\n\nSolution\nAdnan’s team implemented a full-stack AI deployment framework enabling real-time model inference for seismic interpretation. The system integrates large neural networks into interpreter workflows with high responsiveness and minimal setup.\n\nProject 8: Process-Based Subsurface Modeling Platform(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nClient needed a way to create geologically realistic models that accounted for uncertainty in well planning, geosteering, and structural interpretation. Traditional tools were either too rigid or lacked integration across seismic, well, and simulation data.\n\nSolution\nBluware co-developed a process-oriented modeling platform enabling restoration-reconstruction workflows, geologically feasible structures, and synthetic observation prediction. We delivered scalable cloud execution, Python and plugin integrations, and intuitive user interfaces to support decision workflows.\n\nCore Competency\n Subsurface modeling platform development\n Workflow integration with seismic/well tools\n Scalable cloud-based execution\n Long-term platform evolution and support\n\nProject 9: Real-Time Seismic Support for Drilling(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nClient lacked real-time visibility into drilling operations and faced challenges processing large volumes of seismic data quickly enough to support operational decisions.\n\nBluware Solution\nWe enhanced a real-time seismic system to process 20+ TB/day, developed drill-bit imaging capabilities, built GPU-accelerated noise classification, and deployed cloud-native services for data management, viewing, and event detection.\n\nCore Competency\n Real-time seismic compute at scale\n GPU-based signal processing pipelines\n Cloud-native architecture and deployment\n Operational support tool development\n\nProject 10: Web-Based Geological Simulation Environment(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nGeoscientists across Client lacked an integrated environment for building and running geological simulations, especially one compatible with open-source standards and modern data exchange protocols.\n\nBluware Solution\nBluware delivered a full-stack web application for simulation setup, visualization, and model interaction. We contributed to open-source simulation components, implemented real-time communication protocols, and ensured compatibility with the client's internal data systems.\n\nCore Competency\n End-to-end geoscience platform development\n Open source and open standards (ETP, RESQML)\n Real-time, collaborative web tools\n\nProject 11: Early-Phase Planning Acceleration Framework(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nTool development for early-phase field planning was slow due to inconsistent data access, limited infrastructure, and lack of reusable components.\nBluware Solution\nBluware created an accelerator platform providing infrastructure-as-code, secure development environments, pre-built pipelines, and templates for rapid prototyping. It enabled new teams at Client to move quickly from concept to production.\n\nCore Competency\n DevOps and infrastructure automation\n Secure data access and governance\n Rapid enablement for internal squads\n\nProject 12. Enterprise Data Backbone for Drilling Operations(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nClient required reliable access to authoritative well data and faced issues with data duplication, inconsistent pipelines, and manual validation efforts.\n\nBluware Solution\nWe built and supported a robust backend for live ETL, quality validation, and unified access across drilling operations. The solution ensured reusable, trustworthy data pipelines and improved upstream data quality.\n\nCore Competency\n Scalable enterprise ETL design\n Live data synchronization\n Automated validation and monitoring\n\nProject 13. Slot Evaluation and Planning Interface(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nTeams struggled to identify and evaluate re-usable slot opportunities across wellbores due to fragmented data and manual workflows.\n\nBluware Solution\nBluware delivered a collaborative tool that unifies data access, enhances slot search logic, integrates live data sources, and supports export-ready evaluation results.\n\nCore Competency\n Workflow automation and data unification\n Domain-specific search tools\n UX/UI development for operational teams\n\nProject 13. Structural Plate Model Management Tool(Major NOC)\nProject delivered by Adnan’s Team\n\nPain Point\nManaging large-scale plate tectonic models was constrained by software speed, lack of integration, and reliance on legacy storage systems.\n\nBluware Solution\nWe modernized the modeling platform, introduced support for geospatial standards, improved performance, and initiated the move toward cloud-based data storage and sharing.\n\nCore Competency\n Legacy system modernization\n Geospatial data platform engineering\n Cloud migration readiness\n\nProject 14: Geological Model Comparison Plugin(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nSubsurface teams needed an intuitive way to build geological models and compare them against real seismic without relying on heavyweight modeling platforms.\n\nBluware Solution\nBluware developed a plugin enabling fast, analog-driven model building, direct seismic comparison, and seamless data export. The tool is built for usability and extensibility, with a roadmap toward a cloud-native future.\n\nCore Competency\n Plugin development for technical platforms\n Simplified geological modeling workflows\n Design for extensibility and data science use\n\nProject 15: Scalable AI Deployment for Subsurface Interpretation(Major NOC)\nProject Delivered by Adnan’s team\n\nPain Point\nHigh-performing seismic interpretation models were stuck in R&D due to manual workflows, on-prem compute dependency, and lack of integration with production tools.\n\nBluware Solution\nBluware built a scalable, cloud-native platform that operationalized large neural networks for seismic interpretation. The solution integrated real-time predictions into interpreters’ tools and removed the need for technical setup.\n\nCore Competency\n AI model deployment and MLOps\n Cloud-native architecture for seismic ML\n User-centric system design for non-technical users",
  "key_areas_and_projects_delivered_by_the_team_led_by_adnan_at_sirius": "Adnan co-led one of Norway’s largest industrial research consortia, SIRIUS, where his team focused on advancing scalable data access, AI innovation, and semantic technologies across energy, environmental, and healthcare domains. Key projects  include:\n\nProject 1: Geological Assistant / GeMS Project\nRole: Portfolio Leader, SIRIUS – Centre for Scalable Data Access\n\nChallenge:\nExploration geologists traditionally relied on intuitive, manual methods — often pen-and-paper sketches — to evaluate prospects based on sparse, uncertain data. This limited their ability to model and compare multiple subsurface scenarios systematically. Most decisions were based on a narrow set of seismic interpretations, often overemphasizing direct hydrocarbon indicators (DHIs) without integrating broader geological context. This led to misjudgments in several high-cost drilling projects.\n\nSolution:\nLed the development of GeMS (Geological Multi-Scenario Reasoner), a first-of-its-kind system that brought structured AI reasoning to geological interpretation. We combined data-driven seismic analysis with formal logic–based scenario modeling, using techniques from software verification to represent geological rules, spatial-temporal relationships, and interpretive uncertainty. This allowed geoscientists to explore a digital, auditable space of plausible subsurface models — moving beyond single \"best guess\" interpretations.\n\nOutcome:\nGeMS redefined digital geology workflows by introducing a logic-based framework for modeling ambiguity and scenario reasoning. It empowered interpreters to evaluate exploration decisions more systematically, improving transparency and decision quality. This project demonstrated how AI, formal methods, and domain expertise can converge to address complex, high-stakes challenges in exploration.\nLeadership Highlights:\n Directed a multi-partner collaboration across academia (UiO, NTNU), industry (Equinor, Schlumberger), and AI researchers\n Bridged geoscience and software verification domains to create a novel hybrid reasoning system\n Advanced the use of ontology-driven AI tools in operational exploration environments\n\nProject 2: OBDA Subsurface Data Integration Pilot\nRole: Portfolio Leader, SIRIUS – Centre for Scalable Data Access\n\nChallenge:\nSubsurface interpretation workflows were crippled by fragmented data silos and manual data wrangling. Geoscientists spent up to 70% of their time searching, extracting, and cleaning data — instead of interpreting it. There was no semantic layer to unify access across structured databases, unstructured reports, and diverse schemas, limiting reuse and delaying critical exploration decisions.\n\nSolution:\nLed the design and execution of a next-generation Ontology-Based Data Access (OBDA) pilot tailored to geoscience needs. Building on learnings from the Optique EU project, we:\n Created a reusable subsurface ontology and mapping framework for structured and semi-structured data\n Integrated public datasets like Client's Volve and NPD FactPages into a centralized OBDA testbed\n Introduced OTTR templating to automate ontology and mapping generation — cutting effort from weeks to minutes\n Piloted OBDA extensions for non-relational sources (e.g., DISKOS, OSDU, and PDFs)\n Enabled natural-language-like SPARQL querying using geological vocabulary\n\nOutcome:\nThe pilot transformed data access for geoscientists. Instead of requiring SQL expertise or manually navigating reports, users could query complex geological concepts across datasets with semantic precision. It demonstrated how OBDA could power scalable digital transformation in exploration — making workflows faster, smarter, and more intuitive.\nCapabilities Demonstrated:\n Leadership in semantic technologies and domain-driven ontology design\n Integration of federated OBDA across relational, non-relational, and unstructured sources\n Advanced templating and automation for agile data onboarding\n Knowledge graph engineering and digital workflow design for geoscience\n Successful transfer of EU research outcomes to industry-grade pilots\n\nProject 3: SIRIUS Subsurface Lab\nRole: Portfolio Leader, SIRIUS – Centre for Scalable Data Access\n\nChallenge:\nThe Volve field dataset, released for open research by Client, included 40,000+ files (~5TB) spanning seismic, well logs, and reservoir data. While rich, the dataset was hard to use at scale. Proprietary formats, inconsistent metadata, and the lack of an integrated query layer made it inaccessible for researchers, especially those exploring AI or semantic technologies.\n\nSolution:\nI led the design and build-out of the SIRIUS Subsurface Lab — a testbed to enable structured, semantic access to complex geoscientific data. Key contributions included:\n Re-architected the dataset into a simplified MySQL schema aligned with domain file structures\n Built a clean API for fast programmatic access and rapid tool development\n Transformed structured content into an RDF knowledge graph using custom ontology and R2RML mappings\n Deployed a SPARQL endpoint and reasoning engine for semantic exploration\n Enabled integration with external datasets and workflows, forming the foundation for OBDA and AI research\n\nOutcome:\nThe Subsurface Lab became the backbone for applied AI and ontology-driven geoscience experimentation. It reduced onboarding time for researchers, enabled reproducible benchmarking, and supported multiple pilots (e.g., OBDA, GeMS) across academia and industry. It bridged raw data and semantic reasoning — unlocking next-generation digital workflows in subsurface interpretation.\nCapabilities Demonstrated:\n End-to-end data architecture for complex, multi-format datasets\n Ontology design and R2RML mapping for knowledge graph generation\n Semantic enablement of real-world geoscience data (SPARQL, OWL, RDF)\n Cross-domain integration across well, seismic, and public data sources\n Strategic leadership in bridging academic research and industry application\n\nProject 4: Knowledge-Guided Machine Learning for Geoscience\nRole: Collaborator & Research Partner — SIRIUS Centre for Scalable Data Access\n\nChallenge:\nMachine learning in geoscience is hampered by sparse, uncertain data and a heavy reliance on categorical features that carry deep domain meaning (e.g., lithology, depositional environment). Standard ML approaches often fail in these contexts because they treat these categories as flat, statistically neutral labels — losing critical geological nuance and structure.\n\nSolution:\nAs a collaborator on this interdisciplinary research, I supported the design and validation of methods to infuse domain knowledge directly into ML pipelines through:\n Semantic similarity measures using taxonomies and poly-hierarchies to express domain-informed relationships\n Ontology-driven embeddings that replaced shallow encodings with knowledge-grounded vector representations\n Application of these methods to real-world tasks like reservoir analogue identification and clinical outcome prediction across low-resource domains\n\nOutcome:\n Demonstrated superior performance of hierarchy-based similarity vs. classical encodings in subsurface and biomedical applications\n Co-developed a new poly-hierarchy similarity measure with robust behavior under sparse labeling\n Helped validate semantic embeddings that improved generalization in tasks with limited labeled data\n Supported the foundation for future hybrid AI systems that combine structured expert knowledge with machine learning\n\nImpact:\nThe work advanced a new class of knowledge-infused ML approaches tailored for complex, data-scarce domains. It enabled more human-aligned AI systems in exploration workflows — particularly valuable in early-stage evaluation where labeled data is minimal but expert knowledge is rich.\n\nSkills & Competencies Contributed/Gained:\n Semantic encoding of categorical variables\n Ontology design and poly-hierarchy modeling\n Integration of structured domain knowledge in ML workflows\n Cross-domain application testing (geoscience, healthcare, NLP)\n Research collaboration across academia and industry\n\nProject 4: NLP Adaptation for Technical Domains with Sparse Labels\nRole: Collaborator & Geoscience Domain Expert — PhD Project on Low-Resource NLP\n\nChallenge:\nMost high-performing NLP systems require large, well-annotated datasets. In technical fields like oil & gas, such datasets are rare. Textual data is unstructured, specialized, and often proprietary — spanning well reports, log summaries, and scientific documentation. Off-the-shelf NLP models struggle to generalize in these domain-specific, low-resource settings.\n\nSolution:\nAs a domain expert, I collaborated on adapting neural NLP architectures for geoscience use cases by:\n Training domain-specific word embeddings from oil & gas corpora\n Leveraging distant supervision via geoscience knowledge bases to auto-label data\n Using dependency parsing to enhance syntactic extraction in noisy text\n Applying reinforcement learning to filter weakly labeled data\n Exploring meta-learning to generalize models across technical genres and document types\nThese techniques reframed \"low-resource\" not just in linguistic terms but as a broader challenge of working in specialized, annotation-scarce industrial domains.\n\nOutcome:\n Developed NLP pipelines capable of recognizing entities and relations (e.g., formations, reservoir properties) in geoscience texts with minimal supervision\n Proved the value of hybrid strategies combining weak supervision and domain knowledge in NER and classification tasks\n Enabled early-stage prototypes of geoscience-specific NLP tools for semantic search, auto-tagging, and knowledge extraction\n\nImpact:\nThis project paved the way for scalable language understanding in exploration workflows — even in the absence of traditional labeled corpora. It demonstrated that by infusing domain knowledge into model design and training, NLP systems can operate effectively in expert-driven, low-annotation environments.\nSkills & Competencies Contributed/Gained:\n Transfer learning and meta-learning for domain adaptation\n Weak supervision and distant labeling with domain-specific knowledge bases\n Ontology-driven language modeling for technical text\n Bridging structured geological semantics with deep learning architectures\n\nProject 5: Ontology-Driven Geological Image Annotation\nRole: Contributor – AI & Geoscience (SIRIUS Innovation Project)\n\nChallenge:\nIn subsurface exploration, geological images (e.g., cross-sections, sketch interpretations) are vital for reasoning, analogue selection, and teaching. Yet they are buried in documents with no structured metadata, making them:\n Invisible to search engines\n Inaccessible to AI/ML pipelines\n Dependent on manual interpretation by experts\n Unusable in automated workflows despite their scientific value\n\nSolution:\nAs a contributor to both the AI and geoscience dimensions of the project, I helped design and deliver SIRIUS Geo-Annotator — a prototype system that enables semantic annotation and search of geological images using ontologies and knowledge graphs.\nKey components included:\n A custom ontology (SiriusGeoOnto) to represent geological concepts in imagery\n An interactive tagging interface using navigation graphs and auto-suggestions\n OWL 2 reasoning (HermiT) and RDFox to infer spatial and conceptual relationships\n A backend that supported SPARQL querying over geological concepts and relationships\n\nOutcome:\n Enabled geoscientists to retrieve images based on geological features (e.g., “faulted carbonate reef with overlying shale”) rather than file names or captions\n Populated machine-readable knowledge graphs from visual content\n Created a reusable foundation for AI-ready datasets for tasks like geological image classification and analogue search\n\nImpact:\nThis was the first ontology-driven system to semantically annotate geological images. It demonstrated how expert interpretation can be transformed into structured knowledge that is searchable, shareable, and explainable — making visual geological content accessible for both humans and machines.\nSkills & Contributions:\n Ontology design for geoscientific image domains\n Semantic reasoning and graph-based data modeling\n Bridging expert annotation workflows with AI readiness\n Developing search systems driven by logic, not keywords\n Designing systems where AI enhances expert judgment without replacing it\n\n\nResearch Program 1: Semantic Research for Subsurface Intelligence\nRole: Active Contributor – AI, Ontology, and Geoscience Integration\n\nChallenge\nSubsurface and industrial data environments are fragmented, opaque, and heavily domain specific. Geoscientists face major friction in extracting insights due to siloed formats, lack of semantic tools, and AI systems that are blind to expert knowledge. Ontology development is slow, and federated data access is unreliable.\n\nSolution\nAs an active contributor across multiple research programs at SIRIUS, I helped design and implement scalable, ontology-driven frameworks for semantic access, reasoning, and AI integration in the energy domain.\nKey initiatives and contributions:\n Ontology Engineering\no Applied OTTR templating for modular, reusable geoscience ontologies\no Bridged visual tools like OptiqueVQS with SPARQL endpoints to empower non-experts\n Semantic Integration\no Led Virtual Knowledge Graph (VKG) pipelines using Ontop for relational subsurface data\no Experimented with Materialized Knowledge Graphs using RDFox for large-scale reasoning\no Connected geoscientific semantics with structured + unstructured data pipelines\n Applied Use Cases\no Supported projects like OBDA Pilot, Geo-Annotator, and SPARQL-powered search tools\no Enabled SPARQL access to domain concepts across legacy and cloud-based systems\n\nOutcome\n Dramatically reduced time-to-insight for geoscientists querying multi-source data\n Lowered the barrier for domain experts to contribute to ontology workflows\n Created reusable frameworks that scale to real-world E&P settings\n Enabled semantic workflows that support AI, search, and human reasoning alike\n\nCore Competencies Demonstrated:\n Ontology engineering (OTTR, OWL, SHACL)\n Semantic reasoning with HermiT and RDFox\n Federated knowledge access using VKG and MKG\n Subsurface data modeling across SQL, JSON, and RDF\n Applied AI in industrial knowledge graph construction\n\nResearch Program 2: Hybrid AI for Low-Resource Scientific Domains\nRole: Contributor – AI & Domain Knowledge Integration (SIRIUS Program)\n\nChallenge\nTraditional ML fails in domains like oil & gas where data is scarce, labels are weak, and semantics are complex. Existing AI tools ignore the vast reservoir of structured domain knowledge embedded in taxonomies, heuristics, and ontologies — resulting in brittle and unexplainable models.\n\nSolution\nI collaborated on the Domain-Adapted Data Science program to fuse symbolic and neural AI for more effective learning in data-poor but knowledge-rich environments.\n\nApproach included:\n Using domain ontologies to guide ML model architecture\n Creating semantic embeddings based on geoscience hierarchies\n Applying hybrid models that combine rules, reasoning, and deep learning\n Designing interpretable AI components for real-world tasks\n\nOutcome\n Improved model performance in subsurface analogue prediction, lithology classification, and domain-specific NER\n Enabled use of small expert-curated knowledge bases to bootstrap learning\n Delivered early-stage explainability and robustness in exploration ML workflows\n\nKey Skills Applied:\n Ontology-informed ML and symbolic–neural fusion\n Semantic embedding techniques for categorical features\n Low-resource NLP and hybrid architectures\n Explainable AI (XAI) for technical decision-making"
}